<img src="https://i.imgur.com/lB4ujby.png">

TAGS: Data Analysis, Python, Pandas, Data Manipulation, External Dataset

You are given a data set of Baby names. Using this, write code to determine what the top boy and girl names were in 2009.

Below is code to import the dataset into a dataframe, to help get you started:

In [1]:
#importing libaries
import numpy as np
import pandas as pd

#reading csv into a dataframe
baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

#viewing dataframe
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

In [10]:
baby_names.isna().sum()

Unnamed: 0    0
Id            0
Name          0
Year          0
Gender        0
State         0
Count         0
dtype: int64

In [19]:
df_2009 = baby_names[baby_names['Year'] == 2009]
df_2009.head()

      Unnamed: 0     Id      Name  Year Gender State  Count
1063       12412  12413  Isabella  2009      F    AK     57
1064       12413  12414    Sophia  2009      F    AK     46
1065       12414  12415    Olivia  2009      F    AK     45
1066       12415  12416   Abigail  2009      F    AK     43
1067       12416  12417       Ava  2009      F    AK     41

In [20]:
# Coincidentally first two most popular are male and female
df_2009.sort_values(by='Count', ascending = False)

         Unnamed: 0       Id      Name  Year Gender State  Count
121618       692795   692796    Daniel  2009      M    CA   3391
83117        541180   541181  Isabella  2009      F    CA   3158
121619       692796   692797   Anthony  2009      M    CA   3086
121620       692797   692798     Angel  2009      M    CA   3003
121621       692798   692799     Jacob  2009      M    CA   2970
...             ...      ...       ...   ...    ...   ...    ...
867097      4919132  4919133     Denia  2009      F    TX      5
867098      4919133  4919134   Deserae  2009      F    TX      5
867099      4919134  4919135  Destynee  2009      F    TX      5
867100      4919135  4919136   Dolores  2009      F    TX      5
1015532     5646563  5646564    Xavier  2009      M    WY      5

[94609 rows x 7 columns]

In [30]:
# Sanity check to make sure that df_2009 only has the one year in it
df_2009['Year'].unique(), len(df_2009['Year'].unique())

(array([2009]), 1)

In [31]:
# Checking to see if there are any duplicate names that might need to be aggregated for a new total
# Because there is (presumably because it's separated by state) names + counts will need to be aggregated
len(df_2009['Name']) - len(df_2009['Name'].drop_duplicates())

84619

In [25]:
df_2009.groupby(['Name', 'Gender']).agg({'Count': 'sum'}).sort_values(by = 'Count',ascending = False).head(10)

                  Count
Name      Gender
Isabella  F       22278
Jacob     M       21144
Ethan     M       19834
Michael   M       18909
Alexander M       18215
William   M       17899
Emma      F       17881
Joshua    M       17622
Daniel    M       17521
Olivia    F       17420

# Conclusion: Isabella (F) and Jacob (M) are the most popular names in 2009